---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireSetIterator
source: html/5713c3b7-0345-03e6-b44c-08fb029d7d3d.htm
---
# Autodesk.Revit.DB.Electrical.WireSetIterator

An iterator to a set.

## Syntax (C#)
```csharp
public abstract class WireSetIterator : APIObject,
	IEnumerator
```